espressif/esp-idf/components/soc/esp32c5/include/soc/spi1_mem_struct.h
/** Type of w5 register
 *  SPI1 memory data buffer5
 */
typedef union {
    struct {
        /** buf5 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf5:32;
    };
    uint32_t val;
} spi1_mem_w5_reg_t;

/** Type of w6 register
 *  SPI1 memory data buffer6
 */
typedef union {
    struct {
        /** buf6 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf6:32;
    };
    uint32_t val;
} spi1_mem_w6_reg_t;

/** Type of w7 register
 *  SPI1 memory data buffer7
 */
typedef union {
    struct {
        /** buf7 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf7:32;
    };
    uint32_t val;
} spi1_mem_w7_reg_t;

/** Type of w8 register
 *  SPI1 memory data buffer8
 */
typedef union {
    struct {
        /** buf8 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf8:32;
    };
    uint32_t val;
} spi1_mem_w8_reg_t;

/** Type of w9 register
 *  SPI1 memory data buffer9
 */
typedef union {
    struct {
        /** buf9 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf9:32;
    };
    uint32_t val;
} spi1_mem_w9_reg_t;

/** Type of w10 register
 *  SPI1 memory data buffer10
 */
typedef union {
    struct {
        /** buf10 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf10:32;
    };
    uint32_t val;
} spi1_mem_w10_reg_t;

/** Type of w11 register
 *  SPI1 memory data buffer11
 */
typedef union {
    struct {
        /** buf11 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf11:32;
    };
    uint32_t val;
} spi1_mem_w11_reg_t;

/** Type of w12 register
 *  SPI1 memory data buffer12
 */
typedef union {
    struct {
        /** buf12 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf12:32;
    };
    uint32_t val;
} spi1_mem_w12_reg_t;

/** Type of w13 register
 *  SPI1 memory data buffer13
 */
typedef union {
    struct {
        /** buf13 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf13:32;
    };
    uint32_t val;
} spi1_mem_w13_reg_t;

/** Type of w14 register
 *  SPI1 memory data buffer14
 */
typedef union {
    struct {
        /** buf14 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf14:32;
    };
    uint32_t val;
} spi1_mem_w14_reg_t;

/** Type of w15 register
 *  SPI1 memory data buffer15
 */
typedef union {
    struct {
        /** buf15 : R/W/SS; bitpos: [31:0]; default: 0;
         *  data buffer
         */
        uint32_t buf15:32;
    };
    uint32_t val;
} spi1_mem_w15_reg_t;


/** Group: Interrupt registers */
/** Type of int_ena register
 *  SPI1 interrupt enable register
 */
typedef union {
    struct {
        /** per_end_int_ena : R/W; bitpos: [0]; default: 0;
         *  The enable bit for SPI1_MEM_PER_END_INT interrupt.
         */
        uint32_t per_end_int_ena:1;
        /** pes_end_int_ena : R/W; bitpos: [1]; default: 0;
         *  The enable bit for SPI1_MEM_PES_END_INT interrupt.
         */
        uint32_t pes_end_int_ena:1;
        /** wpe_end_int_ena : R/W; bitpos: [2]; default: 0;
         *  The enable bit for SPI1_MEM_WPE_END_INT interrupt.
         */
        uint32_t wpe_end_int_ena:1;
        /** slv_st_end_int_ena : R/W; bitpos: [3]; default: 0;
         *  The enable bit for SPI1_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_ena:1;
        /** mst_st_end_int_ena : R/W; bitpos: [4]; default: 0;
         *  The enable bit for SPI1_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_ena:1;
        uint32_t reserved_5:5;
        /** brown_out_int_ena : R/W; bitpos: [10]; default: 0;
         *  The enable bit for SPI1_MEM_BROWN_OUT_INT interrupt.
         */
        uint32_t brown_out_int_ena:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi1_mem_int_ena_reg_t;

/** Type of int_clr register
 *  SPI1 interrupt clear register
 */
typedef union {
    struct {
        /** per_end_int_clr : WT; bitpos: [0]; default: 0;
         *  The clear bit for SPI1_MEM_PER_END_INT interrupt.
         */
        uint32_t per_end_int_clr:1;
        /** pes_end_int_clr : WT; bitpos: [1]; default: 0;
         *  The clear bit for SPI1_MEM_PES_END_INT interrupt.
         */
        uint32_t pes_end_int_clr:1;
        /** wpe_end_int_clr : WT; bitpos: [2]; default: 0;
         *  The clear bit for SPI1_MEM_WPE_END_INT interrupt.
         */
        uint32_t wpe_end_int_clr:1;
        /** slv_st_end_int_clr : WT; bitpos: [3]; default: 0;
         *  The clear bit for SPI1_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_clr:1;
        /** mst_st_end_int_clr : WT; bitpos: [4]; default: 0;
         *  The clear bit for SPI1_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_clr:1;
        uint32_t reserved_5:5;
        /** brown_out_int_clr : WT; bitpos: [10]; default: 0;
         *  The status bit for SPI1_MEM_BROWN_OUT_INT interrupt.
         */
        uint32_t brown_out_int_clr:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi1_mem_int_clr_reg_t;

/** Type of int_raw register
 *  SPI1 interrupt raw register
 */
typedef union {
    struct {
        /** per_end_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit for SPI1_MEM_PER_END_INT interrupt. 1: Triggered when Auto Resume
         *  command (0x7A) is sent and flash is resumed successfully. 0: Others.
         */
        uint32_t per_end_int_raw:1;
        /** pes_end_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit for SPI1_MEM_PES_END_INT interrupt.1: Triggered when Auto Suspend
         *  command (0x75) is sent and flash is suspended successfully. 0: Others.
         */
        uint32_t pes_end_int_raw:1;
        /** wpe_end_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit for SPI1_MEM_WPE_END_INT interrupt. 1: Triggered when WRSR/PP/SE/BE/CE
         *  is sent and flash is already idle. 0: Others.
         */
        uint32_t wpe_end_int_raw:1;
        /** slv_st_end_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit for SPI1_MEM_SLV_ST_END_INT interrupt. 1: Triggered when spi1_slv_st is
         *  changed from non idle state to idle state. It means that SPI_CS raises high. 0:
         *  Others
         */
        uint32_t slv_st_end_int_raw:1;
        /** mst_st_end_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit for SPI1_MEM_MST_ST_END_INT interrupt. 1: Triggered when spi1_mst_st is
         *  changed from non idle state to idle state. 0: Others.
         */
        uint32_t mst_st_end_int_raw:1;
        uint32_t reserved_5:5;
        /** brown_out_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw bit for SPI1_MEM_BROWN_OUT_INT interrupt. 1: Triggered condition is that
         *  chip is loosing power and RTC module sends out brown out close flash request to
         *  SPI1. After SPI1 sends out suspend command to flash, this interrupt is triggered
         *  and MSPI returns to idle state. 0: Others.
         */
        uint32_t brown_out_int_raw:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi1_mem_int_raw_reg_t;

/** Type of int_st register
 *  SPI1 interrupt status register
 */
typedef union {
    struct {
        /** per_end_int_st : RO; bitpos: [0]; default: 0;
         *  The status bit for SPI1_MEM_PER_END_INT interrupt.
         */
        uint32_t per_end_int_st:1;
        /** pes_end_int_st : RO; bitpos: [1]; default: 0;
         *  The status bit for SPI1_MEM_PES_END_INT interrupt.
         */
        uint32_t pes_end_int_st:1;
        /** wpe_end_int_st : RO; bitpos: [2]; default: 0;
         *  The status bit for SPI1_MEM_WPE_END_INT interrupt.
         */
        uint32_t wpe_end_int_st:1;
        /** slv_st_end_int_st : RO; bitpos: [3]; default: 0;
         *  The status bit for SPI1_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_st:1;
        /** mst_st_end_int_st : RO; bitpos: [4]; default: 0;
         *  The status bit for SPI1_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_st:1;
        uint32_t reserved_5:5;
        /** brown_out_int_st : RO; bitpos: [10]; default: 0;
         *  The status bit for SPI1_MEM_BROWN_OUT_INT interrupt.
         */
        uint32_t brown_out_int_st:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi1_mem_int_st_reg_t;


/** Group: Timing registers */
/** Type of timing_cali register
 *  SPI1 timing control register
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** timing_cali : R/W; bitpos: [1]; default: 0;
         *  The bit is used to enable timing auto-calibration for all reading operations.
         */
        uint32_t timing_cali:1;
        /** extra_dummy_cyclelen : R/W; bitpos: [4:2]; default: 0;
         *  add extra dummy spi clock cycle length for spi clock calibration.
         */
        uint32_t extra_dummy_cyclelen:3;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} spi1_mem_timing_cali_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35660128;
         *  Version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} spi1_mem_date_reg_t;


typedef struct spi1_mem_dev_t {
    volatile spi1_mem_cmd_reg_t cmd;
    volatile spi1_mem_addr_reg_t addr;
    volatile spi1_mem_ctrl_reg_t ctrl;
    volatile spi1_mem_ctrl1_reg_t ctrl1;
    volatile spi1_mem_ctrl2_reg_t ctrl2;
    volatile spi1_mem_clock_reg_t clock;
    volatile spi1_mem_user_reg_t user;
    volatile spi1_mem_user1_reg_t user1;
    volatile spi1_mem_user2_reg_t user2;
    volatile spi1_mem_mosi_dlen_reg_t mosi_dlen;
    volatile spi1_mem_miso_dlen_reg_t miso_dlen;
    volatile spi1_mem_rd_status_reg_t rd_status;
    uint32_t reserved_030;
    volatile spi1_mem_misc_reg_t misc;
    uint32_t reserved_038[8];
    volatile spi1_mem_wn_reg_t data_buf[16];
    volatile spi1_mem_flash_waiti_ctrl_reg_t flash_waiti_ctrl;
    volatile spi1_mem_flash_sus_ctrl_reg_t flash_sus_ctrl;
    volatile spi1_mem_flash_sus_cmd_reg_t flash_sus_cmd;
    volatile spi1_mem_sus_status_reg_t sus_status;
    uint32_t reserved_0a8[6];
    volatile spi1_mem_int_ena_reg_t int_ena;
    volatile spi1_mem_int_clr_reg_t int_clr;
    volatile spi1_mem_int_raw_reg_t int_raw;
    volatile spi1_mem_int_st_reg_t int_st;
    uint32_t reserved_0d0;
    volatile spi1_mem_ddr_reg_t ddr;
    uint32_t reserved_0d8[42];
    volatile spi1_mem_timing_cali_reg_t timing_cali;
    uint32_t reserved_184[31];
    volatile spi1_mem_clock_gate_reg_t clock_gate;
    uint32_t reserved_204[126];
    volatile spi1_mem_date_reg_t date;
} spi1_mem_dev_t;

extern spi1_mem_dev_t SPIMEM1;

#ifndef __cplusplus
_Static_assert(sizeof(spi1_mem_dev_t) == 0x400, "Invalid size of spi1_mem_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
